app/Controllers/Home.php

    public function index()
    {
        $servicesModel = new ServicesModel();
        $data['data'] = $servicesModel->findAll();
---
SELECT *
FROM `services`

    public function pakageList($id)
    {
        $servicesModel = new ServicesModel();
        $x = new PackagesModel();
        $data['data'] = $x->findAll();
---
SELECT *
FROM `packages`

    public function postPackages()
    {
        $packageModel = new PackagesModel();
        $pack = $this->request->getPost('service_id');

        $data = [
            'service_id' => $this->request->getPost('service_id'),
            'name' => $this->request->getPost('packageName'),
            'price' => $this->request->getPost('packagePrice'),
            'description' => $this->request->getPost('packageDescription'),
            'created_by' => 1,
            'updated_by' => 1,
        ];

        // print_r($data);
        $packageModel->insert($data);
---
INSERT INTO `packages` (`service_id`, `name`, `price`, `description`, `created_by`, `updated_by`) VALUES ('25', 'sdafjlk', 'dsfakjlk', 'sdlfjlk', 1, 1)