app/Models/PackagesModel.php

DELETE FROM `packages`
WHERE `id` IN ('13')
---
    public function deletePackage($id) {
        return $this->delete($id);

UPDATE `packages` SET `name` = '2st ', `price` = '1000', `description` = 'this is descsdf'
WHERE `id` = '16'
---
    public function updatePackage($id , $data) {
        $this->db->table('packages')
        ->where('id', $id)
        ->update($data);