app/Models/ServicesModel.php

DELETE FROM `services`
WHERE `id` IN ('18')
---
    public function deleteService($id) {
        return $this->delete($id);

SELECT *
FROM `packages`
WHERE `service_id` = '25'
---
    public function getPackagesByServiceId($serviceId)
    {
        $query = $this->db->table('packages')
                      ->where('service_id', $serviceId)
                      ->get();

    return $query->getResultArray();

UPDATE `services` SET `name` = NULL, `location` = NULL, `contact` = NULL, `description` = NULL
WHERE `id` = '16'
---
    public function updateService($id, $data)
    {
        $this->db->table('services')
        ->where('id', $id)
        ->update($data);